Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/atdf/PIC32MZ1024EFM124.atdf
         <register caption="" name="s6" offset="0x58" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="s6"/>
         </register>
         <register caption="" name="s7" offset="0x5c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="s7"/>
         </register>
         <register caption="" name="t8" offset="0x60" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t8"/>
         </register>
         <register caption="" name="t9" offset="0x64" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t9"/>
         </register>
         <register caption="" name="k0" offset="0x68" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="k0"/>
         </register>
         <register caption="" name="k1" offset="0x6c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="k1"/>
         </register>
         <register caption="" name="gp" offset="0x70" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="gp"/>
         </register>
         <register caption="" name="sp" offset="0x74" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="sp"/>
         </register>
         <register caption="" name="fp" offset="0x78" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="fp"/>
         </register>
         <register caption="" name="ra" offset="0x7c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ra"/>
         </register>
         <register caption="" name="Index" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="Index"/>
            <bitfield mask="0x80000000" name="P"/>
         </register>
         <register caption="" name="Random" offset="0x84" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="Random"/>
         </register>
         <register caption="" name="EntryLo0" offset="0x88" rw="RW" size="4">
            <bitfield mask="0x00000001" name="G"/>
            <bitfield mask="0x00000002" name="V"/>
            <bitfield mask="0x00000004" name="D"/>
            <bitfield mask="0x00000038" name="C"/>
            <bitfield mask="0x03FFFFC0" name="PFN"/>
            <bitfield mask="0x40000000" name="XI"/>
            <bitfield mask="0x80000000" name="RI"/>
         </register>
         <register caption="" name="EntryLo1" offset="0x8c" rw="RW" size="4">
            <bitfield mask="0x00000001" name="G"/>
            <bitfield mask="0x00000002" name="V"/>
            <bitfield mask="0x00000004" name="D"/>
            <bitfield mask="0x00000038" name="C"/>
            <bitfield mask="0x03FFFFC0" name="PFN"/>
            <bitfield mask="0x40000000" name="XI"/>
            <bitfield mask="0x80000000" name="RI"/>
         </register>
         <register caption="" name="Context" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x007FFFF8" name="BadVPN2"/>
            <bitfield mask="0xFF800000" name="PTEBase"/>
         </register>
         <register caption="" name="UserLocal" offset="0x94" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="USERLOCAL"/>
         </register>
         <register caption="" name="PageMask" offset="0x98" rw="RW" size="4">
            <bitfield mask="0x1FFFE000" name="Mask"/>
         </register>
         <register caption="" name="PageGrain" offset="0x9c" rw="RW" size="4">
            <bitfield mask="0x08000000" name="IEC"/>
            <bitfield mask="0x40000000" name="XIE"/>
            <bitfield mask="0x80000000" name="RIE"/>
         </register>
         <register caption="" name="Wired" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="Wired"/>
         </register>
         <register caption="" name="HWREna" offset="0xa4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="Mask"/>
            <bitfield mask="0x20000000" name="ULR"/>
         </register>
         <register caption="" name="BadVAddr" offset="0xa8" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="BadVAddr"/>
         </register>
         <register caption="" name="BadInstr" offset="0xac" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="BadInstr"/>
         </register>
         <register caption="" name="BadInstrP" offset="0xb0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="BadInstrP"/>
         </register>
         <register caption="" name="Count" offset="0xb4" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="Count"/>
         </register>
         <register caption="" name="EntryHi" offset="0xb8" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="ASID"/>
            <bitfield mask="0xFFFFE000" name="VPN2"/>
         </register>
         <register caption="" name="Compare" offset="0xbc" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="Compare"/>
         </register>
         <register caption="" name="Status" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="IE"/>
            <bitfield mask="0x00000002" name="EXL"/>
            <bitfield mask="0x00000004" name="ERL"/>
            <bitfield mask="0x00000010" name="UM"/>
            <bitfield mask="0x0001FC00" name="IPL"/>
            <bitfield mask="0x00040000" name="IPL7"/>
            <bitfield mask="0x00080000" name="NMI"/>
            <bitfield mask="0x00100000" name="SR"/>
            <bitfield mask="0x00200000" name="TS"/>
            <bitfield mask="0x00400000" name="BEV"/>
            <bitfield mask="0x01000000" name="MX"/>
            <bitfield mask="0x02000000" name="RE"/>
            <bitfield mask="0x04000000" name="FR"/>
            <bitfield mask="0x08000000" name="RP"/>
            <bitfield mask="0x10000000" name="CU0"/>
            <bitfield mask="0x20000000" name="CU1"/>
         </register>
         <register caption="" name="IntCtl" offset="0xc4" rw="RW" size="4">
            <bitfield mask="0x000003E0" name="VS"/>
            <bitfield mask="0x00002000" name="USESTK"/>
            <bitfield mask="0x00004000" name="APE"/>
            <bitfield mask="0x00008000" name="CLREXL"/>
            <bitfield mask="0x001F0000" name="STKDEC"/>
            <bitfield mask="0x00200000" name="ICE"/>
            <bitfield mask="0x00400000" name="PF"/>
         </register>
         <register caption="" name="SRSCtl" offset="0xc8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="CSS"/>
            <bitfield mask="0x000003C0" name="PSS"/>
            <bitfield mask="0x0000F000" name="ESS"/>
            <bitfield mask="0x003C0000" name="EICSS"/>
            <bitfield mask="0x3C000000" name="HSS"/>
         </register>
         <register caption="" name="SRSMap" offset="0xcc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SSV0"/>
            <bitfield mask="0x000000F0" name="SSV1"/>
            <bitfield mask="0x00000F00" name="SSV2"/>
            <bitfield mask="0x0000F000" name="SSV3"/>
            <bitfield mask="0x000F0000" name="SSV4"/>
            <bitfield mask="0x00F00000" name="SSV5"/>
            <bitfield mask="0x0F000000" name="SSV6"/>
            <bitfield mask="0xF0000000" name="SSV7"/>
         </register>
