Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/atdf/PIC32MZ1024EFM124.atdf
         <register caption="" name="View_IPL" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x000003FC" name="IPL"/>
         </register>
         <register caption="" name="SRSMAP2" offset="0xd4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SSV8"/>
            <bitfield mask="0x000000F0" name="SSV9"/>
         </register>
         <register caption="" name="GTOffset" offset="0xd8" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="GTOffset"/>
         </register>
         <register caption="" name="Cause" offset="0xdc" rw="RW" size="4">
            <bitfield mask="0x0000007C" name="ExcCode"/>
            <bitfield mask="0x00000300" name="IP"/>
            <bitfield mask="0x0003FC00" name="RIPL"/>
            <bitfield mask="0x00200000" name="FDCI"/>
            <bitfield mask="0x00400000" name="WP"/>
            <bitfield mask="0x00800000" name="IV"/>
            <bitfield mask="0x01000000" name="AP"/>
            <bitfield mask="0x02000000" name="IC"/>
            <bitfield mask="0x04000000" name="PCI"/>
            <bitfield mask="0x08000000" name="DC"/>
            <bitfield mask="0x30000000" name="CE"/>
            <bitfield mask="0x40000000" name="TI"/>
            <bitfield mask="0x80000000" name="BD"/>
         </register>
         <register caption="" name="View_RIPL" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="IP"/>
            <bitfield mask="0x000003FC" name="RIPL"/>
         </register>
         <register caption="" name="NestedExc" offset="0xe4" rw="RW" size="4">
            <bitfield mask="0x0000000C" name="NEXL"/>
            <bitfield mask="0x00000030" name="NERL"/>
         </register>
         <register caption="" name="EPC" offset="0xe8" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="EPC"/>
         </register>
         <register caption="" name="NestedEPC" offset="0xec" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="EPC"/>
         </register>
         <register caption="" name="PRId" offset="0xf0" rw="R" size="4">
            <bitfield mask="0x00000003" name="Patch"/>
            <bitfield mask="0x0000001C" name="MINrev"/>
            <bitfield mask="0x000000E0" name="MAJrev"/>
            <bitfield mask="0x0000FF00" name="PrID"/>
            <bitfield mask="0x00FF0000" name="CoID"/>
         </register>
         <register caption="" name="EBASE" offset="0xf4" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="CPUNum"/>
            <bitfield mask="0x3FFFF000" name="ExBase"/>
         </register>
         <register caption="" name="CDMMBase" offset="0xf8" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="CDMMSize"/>
            <bitfield mask="0x00000200" name="CI"/>
            <bitfield mask="0x00000400" name="EN"/>
            <bitfield mask="0xFFFFF800" name="CDMMUA"/>
         </register>
         <register caption="Configuration Register; CP0 Register 16, Select 0" name="Config" offset="0xfc" rw="RW" size="4">
            <bitfield caption="Kseg0 Coherency Algorithm bits" mask="0x00000007" name="K0" values="Config__K0"/>
            <bitfield caption="MMU Type bits" mask="0x00000380" name="MT" values="Config__MT"/>
            <bitfield caption="Architecture Revision Level bits" mask="0x00001C00" name="AR" values="Config__AR"/>
            <bitfield caption="Architecture Type bits" mask="0x00006000" name="AT" values="Config__AT"/>
            <bitfield caption="Endian Mode bit" mask="0x00008000" name="BE" values="Config__BE"/>
            <bitfield caption="Burst Mode bit" mask="0x00010000" name="BM" values="Config__BM"/>
            <bitfield caption="Merge Mode bits" mask="0x00060000" name="MM" values="Config__MM"/>
            <bitfield caption="Multiply/Divide Unit bit" mask="0x00100000" name="MDU" values="Config__MDU"/>
            <bitfield caption="SimpleBE bit" mask="0x00200000" name="SB" values="Config__SB"/>
            <bitfield caption="User-defined bit" mask="0x00400000" name="UDI" values="Config__UDI"/>
            <bitfield caption="Data Scratch Pad RAM bit" mask="0x00800000" name="DSP" values="Config__DSP"/>
            <bitfield caption="Instruction Scratch Pad RAM bit" mask="0x01000000" name="ISP" values="Config__ISP"/>
            <bitfield mask="0x0E000000" name="KU"/>
            <bitfield mask="0x70000000" name="K23"/>
            <bitfield mask="0x80000000" name="M"/>
         </register>
         <register caption="Configuration Register 1; CP0 Register 16, Select 1" name="Config1" offset="0x100" rw="R" size="4">
            <bitfield caption="Floating Point Unit bit" mask="0x00000001" name="FP" values="Config1__FP"/>
            <bitfield caption="EJTAG Present bit" mask="0x00000002" name="EP" values="Config1__EP"/>
            <bitfield caption="Code Compression Implemented bit" mask="0x00000004" name="CA" values="Config1__CA"/>
            <bitfield caption="Watch Register Presence bit" mask="0x00000008" name="WR" values="Config1__WR"/>
            <bitfield caption="Performance Counter bit" mask="0x00000010" name="PC" values="Config1__PC"/>
            <bitfield caption="Data-Cache Associativity bits" mask="0x00000380" name="DA" values="Config1__DA"/>
            <bitfield caption="Data-Cache Line bits" mask="0x00001C00" name="DL" values="Config1__DL"/>
            <bitfield caption="Data-Cache Sets bits" mask="0x0000E000" name="DS" values="Config1__DS"/>
            <bitfield caption="Instruction-Cache Associativity bits" mask="0x00070000" name="IA" values="Config1__IA"/>
            <bitfield caption="Instruction-Cache Line bits" mask="0x00380000" name="IL" values="Config1__IL"/>
            <bitfield caption="Instruction Cache Sets bits" mask="0x01C00000" name="IS" values="Config1__IS"/>
            <bitfield mask="0x7E000000" name="MMUsz"/>
            <bitfield mask="0x80000000" name="M"/>
         </register>
         <register caption="" name="Config2" offset="0x104" rw="R" size="4">
            <bitfield mask="0x80000000" name="M"/>
         </register>
