Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/atdf/PIC32MZ1024EFM124.atdf
         <register caption="Ethernet Controller MAC MII Management Indicators Register" name="EMAC1MIND" offset="0x2d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="MIIMBUSY"/>
            <bitfield mask="0x00000002" name="SCAN"/>
            <bitfield mask="0x00000004" name="NOTVALID"/>
            <bitfield mask="0x00000008" name="LINKFAIL"/>
         </register>
         <register caption="Ethernet Controller MAC Station Address 0 Register" name="EMAC1SA0" offset="0x300" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="STNADDR5"/>
            <bitfield mask="0x0000FF00" name="STNADDR6"/>
         </register>
         <register caption="Ethernet Controller MAC Station Address 1 Register" name="EMAC1SA1" offset="0x310" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="STNADDR3"/>
            <bitfield mask="0x0000FF00" name="STNADDR4"/>
         </register>
         <register caption="Ethernet Controller MAC Station Address 2 Register" name="EMAC1SA2" offset="0x320" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="STNADDR1"/>
            <bitfield mask="0x0000FF00" name="STNADDR2"/>
         </register>
      </register-group>
      <value-group caption="Manual Flow Control bit" name="ETHCON1__MANFC">
         <value caption="Manual Flow Control is enabled" name="" value="0x1"/>
         <value caption="Manual Flow Control is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Automatic Flow Control bit" name="ETHCON1__AUTOFC">
         <value caption="Automatic Flow Control enabled" name="" value="0x1"/>
         <value caption="Automatic Flow Control disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Enable bit" name="ETHCON1__RXEN">
         <value caption="Enable RX logic" name="" value="0x1"/>
         <value caption="Disable RX logic" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Request to Send bit" name="ETHCON1__TXRTS">
         <value caption="Activate the TX logic and send the packet(s) defined in the TX EDT" name="" value="0x1"/>
         <value caption="Stop transmit (when cleared by software) or transmit done (when cleared by hardware)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Ethernet Stop in Idle Mode bit" name="ETHCON1__SIDL">
         <value caption="Ethernet module transfers are paused during Idle mode" name="" value="0x1"/>
         <value caption="Ethernet module transfers continue during Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Ethernet ON bit" name="ETHCON1__ON">
         <value caption="Ethernet module is enabled" name="" value="0x1"/>
         <value caption="Ethernet module is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX Data Buffer Size for All RX Descriptors bits" name="ETHCON2__RXBUFSZ">
         <value caption="RX data Buffer size for descriptors is 2032 bytes" name="" value="0x7f"/>
         <value caption="RX data Buffer size for descriptors is 1536 bytes" name="" value="0x60"/>
         <value caption="RX data Buffer size for descriptors is 48 bytes" name="" value="0x3"/>
         <value caption="RX data Buffer size for descriptors is 32 bytes" name="" value="0x2"/>
         <value caption="RX data Buffer size for descriptors is 16 bytes" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="Broadcast Enable bit" name="ETHRXFC__BCEN">
         <value caption="Enable Broadcast Filtering" name="" value="0x1"/>
         <value caption="Disable Broadcast Filtering" name="" value="0x0"/>
      </value-group>
      <value-group caption="Multicast Enable bit" name="ETHRXFC__MCEN">
         <value caption="Enable Multicast Filtering" name="" value="0x1"/>
         <value caption="Disable Multicast Filtering" name="" value="0x0"/>
      </value-group>
      <value-group caption="Not Me Unicast Enable bit" name="ETHRXFC__NOTMEEN">
         <value caption="Enable Not Me Unicast Filtering" name="" value="0x1"/>
         <value caption="Disable Not Me Unicast Filtering" name="" value="0x0"/>
      </value-group>
      <value-group caption="Unicast Enable bit" name="ETHRXFC__UCEN">
         <value caption="Enable Unicast Filtering" name="" value="0x1"/>
         <value caption="Disable Unicast Filtering" name="" value="0x0"/>
      </value-group>
      <value-group caption="Runt Enable bit" name="ETHRXFC__RUNTEN">
         <value caption="The received packet must not be a runt packet for the packet to be accepted" name="" value="0x1"/>
         <value caption="Disable Runt filtering" name="" value="0x0"/>
      </value-group>
      <value-group caption="Runt Error Collection Enable bit" name="ETHRXFC__RUNTERREN">
         <value caption="The received packet must be a runt packet for the packet to be accepted" name="" value="0x1"/>
         <value caption="Disable Runt Error Collection filtering" name="" value="0x0"/>
      </value-group>
      <value-group caption="CRC OK Enable bit" name="ETHRXFC__CRCOKEN">
         <value caption="The received packet CRC must be valid for the packet to be accepted" name="" value="0x1"/>
         <value caption="Disable CRC filtering" name="" value="0x0"/>
      </value-group>
      <value-group caption="CRC Error Collection Enable bit" name="ETHRXFC__CRCERREN">
         <value caption="The received packet CRC must be invalid for the packet to be accepted" name="" value="0x1"/>
         <value caption="Disable CRC Error Collection filtering" name="" value="0x0"/>
      </value-group>
      <value-group caption="Pattern Match Mode bits" name="ETHRXFC__PMMODE">
         <value caption="Pattern match is successful if (NOTPM = 1 XOR Pattern Match Checksum matches) AND (Packet = Magic Packet)(1" name="" value="0x9"/>
         <value caption="Pattern match is successful if (NOTPM = 1 XOR Pattern Match Checksum matches) AND (Hash Table Filter match)(1" name="" value="0x8"/>
         <value caption="Pattern match is successful if (NOTPM = 1 XOR Pattern Match Checksum matches) AND(Destination Address = Broadcast Address)(1)" name="" value="0x7"/>
         <value caption="Pattern match is successful if (NOTPM = 1 XOR Pattern Match Checksum matches) AND (Destination Address = Broadcast Address)(1)" name="" value="0x6"/>
         <value caption="Pattern match is successful if (NOTPM = 1 XOR Pattern Match Checksum matches) AND (Destination Address = Unicast Address)(1)" name="" value="0x5"/>
         <value caption="Pattern match is successful if (NOTPM = 1 XOR Pattern Match Checksum matches) AND (Destination Address = Unicast Address)(1)" name="" value="0x4"/>
         <value caption="Pattern match is successful if (NOTPM = 1 XOR Pattern Match Checksum matches) AND (Destination Address = Station Address)(1)" name="" value="0x3"/>
         <value caption="Pattern match is successful if (NOTPM = 1 XOR Pattern Match Checksum matches) AND(Destination Address = Station Address)(1)" name="" value="0x2"/>
         <value caption="Pattern match is successful if (NOTPM = 1 XOR Pattern Match Checksum matches)(1)" name="" value="0x1"/>
         <value caption="Pattern Match is disabled; pattern match is always unsuccessful" name="" value="0x0"/>
      </value-group>
      <value-group caption="Pattern Match Inversion bit" name="ETHRXFC__NOTPM">
         <value caption="The Pattern Match Checksum must not match for a successful Pattern Match to occur" name="" value="0x1"/>
         <value caption="The Pattern Match Checksum must match for a successful Pattern Match to occur" name="" value="0x0"/>
      </value-group>
      <value-group caption="Magic Packet Enable bit" name="ETHRXFC__MPEN">
         <value caption="Enable Magic Packet Filtering" name="" value="0x1"/>
         <value caption="Disable Magic Packet Filtering" name="" value="0x0"/>
      </value-group>
