Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/atdf/PIC32MZ1024EFM124.atdf
         <register caption="" name="CNENJ" offset="0x880" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENJ0"/>
            <bitfield mask="0x00000002" name="CNENJ1"/>
            <bitfield mask="0x00000004" name="CNENJ2"/>
            <bitfield mask="0x00000008" name="CNENJ3"/>
            <bitfield mask="0x00000010" name="CNENJ4"/>
            <bitfield mask="0x00000020" name="CNENJ5"/>
            <bitfield mask="0x00000040" name="CNENJ6"/>
            <bitfield mask="0x00000080" name="CNENJ7"/>
            <bitfield mask="0x00000100" name="CNENJ8"/>
            <bitfield mask="0x00000200" name="CNENJ9"/>
            <bitfield mask="0x00000400" name="CNENJ10"/>
            <bitfield mask="0x00000800" name="CNENJ11"/>
            <bitfield mask="0x00001000" name="CNENJ12"/>
            <bitfield mask="0x00002000" name="CNENJ13"/>
            <bitfield mask="0x00004000" name="CNENJ14"/>
            <bitfield mask="0x00008000" name="CNENJ15"/>
         </register>
         <register caption="" name="CNSTATA" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATA0"/>
            <bitfield mask="0x00000002" name="CNSTATA1"/>
            <bitfield mask="0x00000004" name="CNSTATA2"/>
            <bitfield mask="0x00000008" name="CNSTATA3"/>
            <bitfield mask="0x00000010" name="CNSTATA4"/>
            <bitfield mask="0x00000020" name="CNSTATA5"/>
            <bitfield mask="0x00000040" name="CNSTATA6"/>
            <bitfield mask="0x00000080" name="CNSTATA7"/>
            <bitfield mask="0x00000100" name="CNSTATA8"/>
            <bitfield mask="0x00000200" name="CNSTATA9"/>
            <bitfield mask="0x00000400" name="CNSTATA10"/>
            <bitfield mask="0x00000800" name="CNSTATA11"/>
            <bitfield mask="0x00001000" name="CNSTATA12"/>
            <bitfield mask="0x00002000" name="CNSTATA13"/>
            <bitfield mask="0x00004000" name="CNSTATA14"/>
            <bitfield mask="0x00008000" name="CNSTATA15"/>
         </register>
         <register caption="" name="CNSTATB" offset="0x190" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATB0"/>
            <bitfield mask="0x00000002" name="CNSTATB1"/>
            <bitfield mask="0x00000004" name="CNSTATB2"/>
            <bitfield mask="0x00000008" name="CNSTATB3"/>
            <bitfield mask="0x00000010" name="CNSTATB4"/>
            <bitfield mask="0x00000020" name="CNSTATB5"/>
            <bitfield mask="0x00000040" name="CNSTATB6"/>
            <bitfield mask="0x00000080" name="CNSTATB7"/>
            <bitfield mask="0x00000100" name="CNSTATB8"/>
            <bitfield mask="0x00000200" name="CNSTATB9"/>
            <bitfield mask="0x00000400" name="CNSTATB10"/>
            <bitfield mask="0x00000800" name="CNSTATB11"/>
            <bitfield mask="0x00001000" name="CNSTATB12"/>
            <bitfield mask="0x00002000" name="CNSTATB13"/>
            <bitfield mask="0x00004000" name="CNSTATB14"/>
            <bitfield mask="0x00008000" name="CNSTATB15"/>
         </register>
         <register caption="" name="CNSTATC" offset="0x290" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATC0"/>
            <bitfield mask="0x00000002" name="CNSTATC1"/>
            <bitfield mask="0x00000004" name="CNSTATC2"/>
            <bitfield mask="0x00000008" name="CNSTATC3"/>
            <bitfield mask="0x00000010" name="CNSTATC4"/>
            <bitfield mask="0x00000020" name="CNSTATC5"/>
            <bitfield mask="0x00000040" name="CNSTATC6"/>
            <bitfield mask="0x00000080" name="CNSTATC7"/>
            <bitfield mask="0x00000100" name="CNSTATC8"/>
            <bitfield mask="0x00000200" name="CNSTATC9"/>
            <bitfield mask="0x00000400" name="CNSTATC10"/>
            <bitfield mask="0x00000800" name="CNSTATC11"/>
            <bitfield mask="0x00001000" name="CNSTATC12"/>
            <bitfield mask="0x00002000" name="CNSTATC13"/>
            <bitfield mask="0x00004000" name="CNSTATC14"/>
            <bitfield mask="0x00008000" name="CNSTATC15"/>
         </register>
         <register caption="" name="CNSTATD" offset="0x390" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATD0"/>
            <bitfield mask="0x00000002" name="CNSTATD1"/>
            <bitfield mask="0x00000004" name="CNSTATD2"/>
            <bitfield mask="0x00000008" name="CNSTATD3"/>
            <bitfield mask="0x00000010" name="CNSTATD4"/>
            <bitfield mask="0x00000020" name="CNSTATD5"/>
            <bitfield mask="0x00000040" name="CNSTATD6"/>
            <bitfield mask="0x00000080" name="CNSTATD7"/>
            <bitfield mask="0x00000100" name="CNSTATD8"/>
            <bitfield mask="0x00000200" name="CNSTATD9"/>
            <bitfield mask="0x00000400" name="CNSTATD10"/>
            <bitfield mask="0x00000800" name="CNSTATD11"/>
            <bitfield mask="0x00001000" name="CNSTATD12"/>
            <bitfield mask="0x00002000" name="CNSTATD13"/>
            <bitfield mask="0x00004000" name="CNSTATD14"/>
            <bitfield mask="0x00008000" name="CNSTATD15"/>
         </register>
         <register caption="" name="CNSTATE" offset="0x490" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATE0"/>
            <bitfield mask="0x00000002" name="CNSTATE1"/>
            <bitfield mask="0x00000004" name="CNSTATE2"/>
            <bitfield mask="0x00000008" name="CNSTATE3"/>
            <bitfield mask="0x00000010" name="CNSTATE4"/>
            <bitfield mask="0x00000020" name="CNSTATE5"/>
            <bitfield mask="0x00000040" name="CNSTATE6"/>
            <bitfield mask="0x00000080" name="CNSTATE7"/>
            <bitfield mask="0x00000100" name="CNSTATE8"/>
            <bitfield mask="0x00000200" name="CNSTATE9"/>
            <bitfield mask="0x00000400" name="CNSTATE10"/>
            <bitfield mask="0x00000800" name="CNSTATE11"/>
            <bitfield mask="0x00001000" name="CNSTATE12"/>
            <bitfield mask="0x00002000" name="CNSTATE13"/>
            <bitfield mask="0x00004000" name="CNSTATE14"/>
            <bitfield mask="0x00008000" name="CNSTATE15"/>
         </register>
